spec/fixtures/refund/success.yml

---
http_interactions:
- request:
    method: post
    uri: https://api-3t.sandbox.paypal.com/nvp
    body:
      encoding: US-ASCII
      string: USER=fnando.vieira%2Bseller_api1.gmail.com&PWD=PRTZZX6JDACB95SA&SIGNATURE=AJnjtLN0ozBP-BF2ZJrj5sfbmGAxAnf5tev1-MgK5Z8IASmtj-Fw.5pt&VERSION=72.0&TRANSACTIONID=4GP25924UB013401J&PROFILEREFERENCE=12345&PAYMENTREQUEST_0_CUSTOM=12345&PAYMENTREQUEST_0_INVNUM=12345&REFUNDTYPE=Full&PAYMENTREQUEST_0_AMT=9.00&AMT=9.00&PAYMENTREQUEST_0_CURRENCYCODE=BRL&CURRENCYCODE=BRL&METHOD=RefundTransaction
    headers:
      accept:
      - ! '*/*'
      user-agent:
      - PayPal::Recurring/1.0.0
      content-type:
      - application/x-www-form-urlencoded
      connection:
      - close
  response:
    status:
      code: 200
      message: OK
    headers:
      date:
      - Mon, 23 Apr 2012 10:53:04 GMT
      server:
      - Apache
      content-length:
      - '251'
      connection:
      - close
      content-type:
      - text/plain; charset=utf-8
    body:
      encoding: US-ASCII
      string: REFUNDTRANSACTIONID=5MM61417CA010574T&FEEREFUNDAMT=0%2e71&GROSSREFUNDAMT=9%2e00&NETREFUNDAMT=8%2e29&CURRENCYCODE=BRL&TOTALREFUNDEDAMOUNT=9%2e00&TIMESTAMP=2012%2d04%2d23T10%3a53%3a10Z&CORRELATIONID=b902163c2d526&ACK=Success&VERSION=72%2e0&BUILD=2808426
    http_version: '1.1'
  recorded_at: Mon, 23 Apr 2012 10:53:10 GMT
recorded_with: VCR 2.1.0
